#include "global.h"
#include "m_npc.h"
#include "game.h"
#include "overlays/gamestates/ovl_play/m_play.h"
#include "m_common_data.h"
#include "6B8A70.h"
#include "m_npc_schedule.h"
#include "m_npc_walk.h"
#include "m_npc_personal_id.h"
#include "6DB420.h"
#include "6F8A60.h"
#include "6DE300.h"
#include "m_time.h"
#include "libc64/malloc.h"
#include "m_malloc.h"
#include "z_std_dma.h"
#include "macros.h"
#include "6E7AD0.h"
#include "libu64/gfxprint.h"
#include "6D9D80.h"
#include "m_field_info.h"
#include "m_mail.h"
#include "6BFE60.h"
#include "6DA460.h"
#include "m_handbill.h"
#include "6B81C0.h"
#include "6E30B0.h"
#include "6C05A0.h"
#include "m_item_name.h"
#include "m_actor.h"
#include "overlays/actors/ovl_Npc/ac_npc.h"
#include "6A5B00.h"
#include "6A83A0.h"
#include "prevent_bss_reordering.h"
#include "segment_symbols.h"
#include "libc64/qrand.h"

typedef struct Struct_D_E03000 {
    /* 0x00 */ u16 unk_00;
    /* 0x02 */ u16 unk_02;
    /* 0x04 */ u16 unk_04;
} Struct_D_E03000; // size = 0x6

typedef struct Struct_D_E04000 {
    /* 0x00 */ char unk00[0x8];
    /* 0x08 */ u8 unk_08[100][PLAYER_NAME_LEN];
} Struct_D_E04000;

typedef struct Struct_D_8010B510_jp {
    /* 0x00 */ u16 unk_00;
    /* 0x02 */ u16 unk_02;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
} Struct_D_8010B510_jp; // size = 0xC

extern u8 D_8010AF58_jp[];

Struct_D_8010B510_jp D_8010B510_jp[] = {
    { 0xD008, 0x0000, 0x00000205, 0x00000002 }, { 0xD01E, 0x0000, 0x00000205, 0x00000002 },
    { 0xD03A, 0x0000, 0x00000205, 0x00000002 }, { 0xD03B, 0x0000, 0x00000205, 0x00000002 },
    { 0xD03C, 0x0000, 0x00000205, 0x00000002 }, { 0xD009, 0x0000, 0x00000205, 0x00000002 },
    { 0xD00A, 0x0000, 0x00000205, 0x00000002 }, { 0xD00B, 0x0000, 0x00000205, 0x00000002 },
    { 0xD014, 0x0000, 0x00000205, 0x00000002 }, { 0xD019, 0x0000, 0x00000205, 0x00000002 },
    { 0xD015, 0x0000, 0x00000205, 0x00000002 }, { 0xD01A, 0x0000, 0x00000205, 0x00000002 },
    { 0xD016, 0x0000, 0x00000205, 0x00000002 }, { 0xD01B, 0x0000, 0x00000205, 0x00000002 },
    { 0xD017, 0x0000, 0x00000205, 0x00000002 }, { 0xD01C, 0x0000, 0x00000205, 0x00000002 },
    { 0xD001, 0x0000, 0x00000206, 0x00000002 }, { 0xD013, 0x0000, 0x00000206, 0x00000002 },
    { 0xD02C, 0x0000, 0x00000206, 0x00000002 }, { 0xD039, 0x0000, 0x00000206, 0x00000002 },
    { 0xD00C, 0x0001, 0x00000207, 0x00000002 }, { 0xD03D, 0x0001, 0x00000207, 0x00000002 },
    { 0xD006, 0x0000, 0x00000208, 0x00000002 }, { 0xD000, 0x0000, 0x00000209, 0x00000003 },
    { 0xD00F, 0x0000, 0x0000020A, 0x00000002 }, { 0xD002, 0x0000, 0x0000020B, 0x00000002 },
    { 0xD007, 0x0001, 0x0000020C, 0x00000008 }, { 0xD003, 0x0001, 0x0000020D, 0x00000004 },
    { 0xD012, 0x0001, 0x0000020E, 0x00000004 }, { 0xD011, 0x0000, 0x0000020F, 0x00000003 },
    { 0xD00D, 0x0000, 0x00000210, 0x00000002 }, { 0xD010, 0x0000, 0x00000210, 0x00000003 },
    { 0xD04E, 0x0000, 0x00000210, 0x00000002 }, { 0xD00E, 0x0000, 0x00000211, 0x00000002 },
    { 0xD025, 0x0000, 0x00000212, 0x00000003 }, { 0xA004, 0x0002, 0x00000213, 0x00000002 },
    { 0xA005, 0x0002, 0x00000213, 0x00000002 }, { 0xA006, 0x0002, 0x00000213, 0x00000002 },
    { 0xA007, 0x0002, 0x00000213, 0x00000002 }, { 0xD018, 0x0002, 0x00000214, 0x00000002 },
    { 0xD05D, 0x0002, 0x00000214, 0x00000002 }, { 0xD066, 0x0002, 0x00000214, 0x00000002 },
    { 0xD004, 0x0000, 0x00000215, 0x00000002 }, { 0xD005, 0x0000, 0x00000215, 0x00000002 },
    { 0xD01D, 0x0000, 0x00000216, 0x00000002 }, { 0xD026, 0x0000, 0x00000217, 0x00000002 },
    { 0xD037, 0x0000, 0x00000218, 0x00000002 }, { 0xD03E, 0x0000, 0x000004E0, 0x00000002 },
    { 0xD065, 0x0000, 0x000004E0, 0x00000002 }, { 0xD068, 0x0000, 0x000004E0, 0x00000002 },
    { 0xD069, 0x0000, 0x000004E0, 0x00000002 }, { 0xD06B, 0x0000, 0x000004E0, 0x00000002 },
    { 0xD064, 0x0000, 0x000004E1, 0x00000002 }, { 0x800D, 0x0000, 0x000004E2, 0x00000002 },
    { 0x800E, 0x0000, 0x000004E2, 0x00000002 }, { 0xA008, 0x0000, 0x000004E2, 0x00000002 },
    { 0xA009, 0x0000, 0x000004E2, 0x00000002 }, { 0xA00A, 0x0000, 0x000004E2, 0x00000002 },
    { 0xA00B, 0x0000, 0x000004E2, 0x00000002 }, { 0xA00C, 0x0000, 0x000004E2, 0x00000002 },
    { 0xA00D, 0x0000, 0x000004E2, 0x00000002 }, { 0xA00E, 0x0000, 0x000004E2, 0x00000002 },
    { 0xA00F, 0x0000, 0x000004E2, 0x00000002 }, { 0xA010, 0x0000, 0x000004E2, 0x00000002 },
};

u8 l_no_name_npc_name[PLAYER_NAME_LEN] = { 0xD4, 0x8E, 0xA6, 0x90, 0x85, 0x42 };

u8 l_no_ending_npc_ending[] = { 0xD3, 0xAF, 0x9D, 0x20 };

s32 category_table1[] = { 0, 2 };

s32 base_str_no[] = { 0x314, 0x334, 0x2F4, 0x219, 0x1E5, 0x354, 0x374, 0x394, 0x3D4, 0x3F4, 0x3B4 };

s32 this_start_no[] = {
    0x00000020, 0x00000040, 0x00000000, 0x00000060, 0x00000080, 0x000000A0,
};
s32 other_start_no[] = {
    0x000000E0, 0x00000100, 0x000000C0, 0x00000120, 0x00000140, 0x00000160,
};

s32* start_no_table[] = { this_start_no, other_start_no };

s32 mail_no[] = { 0xC5, 0xD8 };

typedef void (*Funcs_D_8010B890_jp)(Mail*, Private*, AnmPersonalId*, AnmRemail*, u8);
Funcs_D_8010B890_jp get_remail[] = {
    func_800A8F30_jp,
    func_800A8DB4_jp,
};

s32 D_8010B898_jp[] = { 5, 2, 0 };
s32 category_table2[] = { 0, 0, 2 };

s32 D_8010B8B0_jp[] = { 1, 0 };

u8 D_8010B8B8_jp[] = {
    0x00, 0x00, 0x02, 0x02, 0xFF,
};

typedef struct Struct_D_8010B8C0_jp {
    /* 0x00 */ s32 unk_00;
    /* 0x00 */ s32 unk_04;
} Struct_D_8010B8C0_jp; // size = 0x8

Struct_D_8010B8C0_jp ut_d[] = {
    { 0x00000000, 0x00000000 }, { 0xFFFFFFFF, 0x00000001 }, { 0x00000000, 0x00000001 },
    { 0x00000001, 0x00000001 }, { 0xFFFFFFFF, 0x00000000 }, { 0x00000001, 0x00000000 },
    { 0xFFFFFFFF, 0xFFFFFFFF }, { 0x00000000, 0xFFFFFFFF }, { 0x00000001, 0xFFFFFFFF },
};

u16 set_fg[] = { 0, 0xA012, 0xFFFF, 0xFFFF, 0xFFFF, 0xFFFF, 0xFFFF, 0xFFFF, 0xFFFF };

s32 spec_table[] = { 4, 4, 2, 2, 3, 4 };

s32 npc_grow_table[] = { 0x28, 0x32, 0x3C, 0x46, 0x50, 0x5A, 0x64 };

typedef struct Struct_D_8010B950_jp {
    /* 0x00 */ u16 unk_00;
    /* 0x02 */ u8 unk_02;
    /* 0x03 */ u8 unk_03;
} Struct_D_8010B950_jp; // size = 0x4

Struct_D_8010B950_jp l_npc_temper[] = {
    { 0x0FA0, 0x0C, 0x0F }, { 0x0BB8, 0x0A, 0x0D }, { 0x0FA0, 0x0C, 0x0F },
    { 0x0FA0, 0x0A, 0x0D }, { 0x1388, 0x09, 0x0C }, { 0x1388, 0x09, 0x0C },
};

s32 D_8010B968_jp = -1;

s32 B_80142C00_jp[60];
u8 B_80142CF0_jp[HANDBILL_HEADER_LEN];

typedef struct Struct_B_80142D08_jp {
    /* 0x00 */ char unk00[0x1];
    /* 0x01 */ u8 unk_01;
    /* 0x02 */ u8 unk_02;
    /* 0x03 */ u8 unk_03;
    /* 0x04 */ u8 unk_04;
} Struct_B_80142D08_jp; // size = 0x5

Struct_B_80142D08_jp B_80142D08_jp[60];
u8 B_80142E38_jp[HANDBILL_FOOTER_LEN];
u8 B_80142E58_jp[0x1B];
UNK_TYPE1 PAD_80142E73_jp[3];
Struct_D_E03000 B_80142E78_jp;
u8 B_80142E80_jp[HANDBILL_HEADER_LEN];
u8 B_80142E98_jp[HANDBILL_FOOTER_LEN];
u16 B_80142EB8_jp[16];

typedef struct Struct_B_80142ED8_jp {
    /* 0x00 */ u16 unk_00;
    /* 0x02 */ u8 unk_02;
    /* 0x03 */ u8 unk_03;
    /* 0x04 */ u16 unk_04;
    /* 0x06 */ u16 unk_06;
} Struct_B_80142ED8_jp; // size = 0x8

Struct_B_80142ED8_jp B_80142ED8_jp[ANIMAL_NUM_MAX];

u8 B_80142F50_jp[PLAYER_NAME_LEN];
u8 B_80142F58_jp[PLAYER_NAME_LEN];
u8 B_80142F60_jp[PLAYER_NAME_LEN];
u8 B_80142F68_jp[PLAYER_NAME_LEN];

typedef struct Struct_B_80142F70_jp {
    /* 0x00 */ AnmPersonalId id;
    /* 0x0C */ u8 unk_0C;
} Struct_B_80142F70_jp; // size = 0x10

Struct_B_80142F70_jp B_80142F70_jp;
Mail B_80142F80_jp;
s32 B_80143028_jp[216];
Animal B_80143388_jp;

void func_800A6810_jp(s32* arg0, s32 arg1, s32 arg2) {
    s32 i;
    s32 j;

    for (i = 0; i < arg1; i++) {
        arg0[i] = i;
    }

    while (arg2--) {
        s32 temp;

        i = RANDOM(arg1);
        j = RANDOM(arg1);
        temp = arg0[i];
        arg0[i] = arg0[j];
        arg0[j] = temp;
    }
}

void func_800A6920_jp(u8* catchphrase, s32 len) {
    mem_clear(catchphrase, len, 0x20);
}

void func_800A6940_jp(u8* npcMax) {
    if (*npcMax < ANIMAL_NUM_MAX) {
        (*npcMax)++;
    }
}

void func_800A695C_jp(u8* arg0) {
    if (*arg0 >= 6) {
        (*arg0)--;
    }
}

void mNpc_ClearAnimalPersonalID(AnmPersonalId* anmId) {
    anmId->npcId = 0;
    anmId->nameId = 0xFF;
    anmId->landId = 0xFFFF;
    anmId->looks = 6;
    mNPS_reset_schedule_area(anmId);
    func_80094EE0_jp(anmId->landName);
}

