#include "global.h"
#include "m_npc.h"
#include "game.h"
#include "overlays/gamestates/ovl_play/m_play.h"
#include "m_common_data.h"
#include "6B8A70.h"
#include "m_npc_schedule.h"
#include "m_npc_walk.h"
#include "m_npc_personal_id.h"
#include "6DB420.h"
#include "6F8A60.h"
#include "6DE300.h"
#include "m_time.h"
#include "m_font.h"
#include "libc64/malloc.h"
#include "m_malloc.h"
#include "z_std_dma.h"
#include "macros.h"
#include "6E7AD0.h"
#include "libu64/gfxprint.h"
#include "6D9D80.h"
#include "m_field_info.h"
#include "m_mail.h"
#include "6BFE60.h"
#include "6DA460.h"
#include "m_handbill.h"
#include "6B81C0.h"
#include "6E30B0.h"
#include "6C05A0.h"
#include "m_item_name.h"
#include "m_actor.h"
#include "overlays/actors/ovl_Npc/ac_npc.h"
#include "6A5B00.h"
#include "6A83A0.h"
#include "prevent_bss_reordering.h"
#include "segment_symbols.h"
#include "libc64/qrand.h"

typedef struct Struct_D_E03000 {
    /* 0x00 */ u16 unk_00;
    /* 0x02 */ u16 unk_02;
    /* 0x04 */ u16 unk_04;
} Struct_D_E03000; // size = 0x6
// extern Struct_D_E03000 segment_00E03000[];

typedef struct Struct_D_E04000 {
    /* 0x00 */ char unk00[0x8];
    /* 0x08 */ u8 unk_08[100][PLAYER_NAME_LEN];
} Struct_D_E04000;
// extern Struct_D_E04000 segment_00E04000;

// extern u8 segment_00E0D000[];

u16 D_8010AF00_jp[] = {
    0x0005, 0x0009, 0x000B, 0x000C, 0x000E, 0x0010, 0x0011, 0x0012, 0x0021, 0x0025, 0x0032, 0x0033,
    0x0035, 0x001B, 0x001B, 0x0056, 0x0059, 0x0068, 0x006F, 0x0080, 0x0083, 0x009F, 0x0002, 0x0000,
};

u16 D_8010AF30_jp[] = {
    0x0027, 0x0027, 0x0027, 0x0027, 0x000A, 0x000A, 0x000A, 0x000A, 0x0058, 0x0058,
    0x0058, 0x0058, 0x0058, 0x0058, 0x0058, 0x0058, 0x0058, 0x0013, 0x00A5, 0x0000,
};

u8 D_8010AF58_jp[] = {
    0x02, 0x05, 0x00, 0x00, 0x01, 0x04, 0x01, 0x05, 0x03, 0x05, 0x05, 0x04, 0x01, 0x00, 0x00, 0x01, 0x04, 0x05, 0x03,
    0x04, 0x02, 0x02, 0x04, 0x01, 0x05, 0x04, 0x01, 0x03, 0x01, 0x02, 0x01, 0x04, 0x02, 0x05, 0x00, 0x03, 0x04, 0x04,
    0x02, 0x03, 0x00, 0x03, 0x02, 0x00, 0x03, 0x01, 0x05, 0x04, 0x04, 0x05, 0x03, 0x00, 0x02, 0x00, 0x03, 0x01, 0x01,
    0x05, 0x00, 0x01, 0x02, 0x03, 0x00, 0x02, 0x00, 0x00, 0x02, 0x05, 0x01, 0x04, 0x03, 0x01, 0x02, 0x03, 0x02, 0x01,
    0x02, 0x02, 0x03, 0x00, 0x03, 0x04, 0x03, 0x01, 0x00, 0x02, 0x02, 0x04, 0x03, 0x02, 0x00, 0x03, 0x00, 0x03, 0x04,
    0x02, 0x05, 0x05, 0x04, 0x03, 0x04, 0x02, 0x01, 0x00, 0x02, 0x01, 0x00, 0x03, 0x05, 0x00, 0x03, 0x00, 0x05, 0x01,
    0x00, 0x05, 0x05, 0x00, 0x04, 0x02, 0x05, 0x01, 0x02, 0x03, 0x03, 0x03, 0x01, 0x00, 0x02, 0x01, 0x04, 0x01, 0x04,
    0x05, 0x04, 0x00, 0x03, 0x01, 0x05, 0x04, 0x04, 0x03, 0x05, 0x03, 0x03, 0x00, 0x04, 0x02, 0x02, 0x05, 0x05, 0x03,
    0x01, 0x02, 0x02, 0x04, 0x05, 0x03, 0x00, 0x03, 0x04, 0x01, 0x02, 0x04, 0x00, 0x01, 0x01, 0x03, 0x03, 0x02, 0x03,
    0x04, 0x05, 0x00, 0x02, 0x00, 0x01, 0x05, 0x04, 0x04, 0x05, 0x01, 0x03, 0x04, 0x01, 0x04, 0x05, 0x04, 0x02, 0x05,
    0x04, 0x02, 0x04, 0x02, 0x03, 0x05, 0x02, 0x00, 0x05, 0x04, 0x01, 0x05, 0x00, 0x00, 0x05, 0x05, 0x01, 0x00, 0x05,
    0x04, 0x00, 0x01, 0x00, 0x05, 0x03, 0x01, 0x01, 0x01, 0x00, 0x00,
};

u32 D_8010B034_jp[] = {
    0x11111111, 0x11111111, 0x11111111, 0x11111111, 0x11111111, 0x11111111, 0x11111111, 0x11111111,
    0x11111111, 0x11111111, 0x11111111, 0x11111111, 0x11111111, 0x11111111, 0x11111111, 0x11111111,
};

u32 D_8010B074_jp[] = {
    0x09090909,
};

u32 D_8010B078_jp[] = {
    0x13131313, 0x13131313, 0x13131313, 0x13131313, 0x13131313, 0x13131313, 0x13131313, 0x13131313, 0x13131313,
};

u32 D_8010B09C_jp[] = {
    0x08080808, 0x08080808, 0x08080808, 0x08080808, 0x08080808, 0x08080808, 0x08080808, 0x08080808,
};

u32 D_8010B0BC_jp[] = {
    0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C,
    0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C,
    0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C,
    0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C,
    0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C,
    0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C,
    0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C,
    0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C00,
};

u32 D_8010B1BC_jp[] = {
    0x160D0D0D, 0x0D0D0D0D, 0x0D0D0D0D, 0x0D091515, 0x15141716, 0x19181818, 0x1919181A, 0x0E0B0000,
};

u32 D_8010B1DC_jp[] = {
    0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C,
    0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C,
};

u32 D_8010B21C_jp[] = {
    0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C,
    0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C,
};

u32 D_8010B25C_jp[] = {
    0x01050403,
    0x02061100,
};

u32 D_8010B264_jp[] = {
    0x11111111,
    0x11111111,
    0x11110000,
};

u32 D_8010B270_jp[] = {
    0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C,
    0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C0C, 0x0C0C0C00,
};

u32 D_8010B2A8_jp[] = {
    0x15000000,
};

u32 D_8010B2AC_jp[] = {
    0x11111111, 0x11111111, 0x11111111, 0x11111111, 0x11111111, 0x11111111, 0x11111111, 0x11111111,
    0x11111111, 0x11111111, 0x11111111, 0x11111111, 0x11111111, 0x11111111, 0x11111111, 0x11111111,
    0x11111111, 0x11111111, 0x11111111, 0x11111111, 0x11111111, 0x11111111, 0x11111111, 0x11111111,
};

u32 D_8010B30C_jp[] = {
    0x12121212, 0x12121212, 0x12121212, 0x12121212, 0x12121212, 0x12121212, 0x12121212, 0x12121212,
};

u32 D_8010B32C_jp[] = {
    0x11110000,
};

u32 D_8010B330_jp[] = {
    0x07070707,
};

u32* D_8010B334_jp[] = {
    D_8010B034_jp, D_8010B074_jp, D_8010B078_jp, D_8010B09C_jp, D_8010B0BC_jp, D_8010B1BC_jp,
    D_8010B1DC_jp, D_8010B21C_jp, D_8010B25C_jp, D_8010B264_jp, D_8010B270_jp, D_8010B2A8_jp,
    D_8010B2AC_jp, D_8010B30C_jp, D_8010B32C_jp, D_8010B330_jp,
};

s16 D_8010B374_jp[] = {
    0xFFFF, 0x0000, 0xFFFF, 0x0001, 0xFFFF, 0x0002, 0xFFFF, 0x0003, 0x0000, 0x0004, 0xFFFF, 0x0000, 0xFFFF,
    0x0001, 0xFFFF, 0x0002, 0xFFFC, 0x0003, 0xFFFF, 0x0004, 0xFFFF, 0x0004, 0xFFFF, 0x0004, 0x0000, 0x0004,
    0xFFFF, 0x0000, 0xFFFF, 0x0001, 0xFFFF, 0x0002, 0xFFFC, 0x0003, 0xFFFF, 0x0004, 0xFFFF, 0x0004, 0xFFFF,
    0x0004, 0x0000, 0x0004, 0xFFFF, 0x0000, 0xFFFF, 0x0001, 0xFFFF, 0x0002, 0xFFFC, 0x0003, 0xFFFF, 0x0004,
    0xFFFF, 0x0004, 0xFFFF, 0x0004, 0x0000, 0x0004, 0xFFFF, 0x0000, 0xFFFF, 0x0001, 0xFFFF, 0x0002, 0xFFFC,
    0x0003, 0xFFFF, 0x0004, 0xFFFF, 0x0004, 0xFFFF, 0x0004, 0x0000, 0x0004, 0xFFFF, 0x0000, 0xFFFF, 0x0001,
    0xFFFF, 0x0002, 0xFFFC, 0x0003, 0xFFFF, 0x0004, 0xFFFF, 0x0004, 0xFFFF, 0x0004, 0x0000, 0x0004, 0xFFFF,
    0x0000, 0xFFFF, 0x0001, 0xFFFF, 0x0002, 0xFFFF, 0x0003, 0x0000, 0x0004, 0xFFFF, 0x0000, 0xFFFF, 0x0001,
    0xFFFF, 0x0002, 0xFFFF, 0x0003, 0x0000, 0x0004, 0xFFFF, 0x0000, 0xFFFF, 0x0001, 0xFFFF, 0x0002, 0xFFFF,
    0x0003, 0x0000, 0x0004, 0xFFFF, 0x0000, 0xFFFF, 0x0001, 0xFFFF, 0x0002, 0xFFFF, 0x0003, 0x0000, 0x0004,
};

u32 D_8010B478_jp[] = {
    0x00000000,
    0x64000000,
    0x00000000,
};

u32 D_8010B484_jp[] = {
    0x00000000,
    0x17040404,
    0x04040000,
};

u32 D_8010B490_jp[] = {
    0x00000000,
    0x17070707,
    0x07070000,
    0x00000000,
};

u32 D_8010B4A0_jp[] = {
    0x0000001E,
    0x0000001F,
    0x00000020,
    0x00000021,
};

u16 D_8010B4B0_jp[] = {
    0x0101, 0x010F, 0x0201, 0x020F, 0x0214, 0x0301, 0x030F, 0x0403, 0x0408, 0x040D, 0x0413, 0x0415, 0x0506,
    0x0514, 0x0608, 0x0617, 0x0701, 0x070F, 0x0719, 0x071F, 0x0809, 0x081E, 0x0901, 0x090F, 0x0A01, 0x0A03,
    0x0A05, 0x0A07, 0x0A0A, 0x0A10, 0x0A14, 0x0A19, 0x0B08, 0x0B0C, 0x0B17, 0x0C09, 0x0C14, 0x0C19,
};

u16 D_8010B4FC_jp[] = {
    0x0C1C,
    0x0000,
};

u8 D_8010B500_jp[] = {
    0x23,
    0x7B,
};

u16 D_8010B504_jp[] = {
    0x076D, 0x080F, 0x076D, 0x090D, 0x0000, 0x0000,
};

typedef struct Struct_D_8010B510_jp {
    /* 0x00 */ u16 unk_00;
    /* 0x02 */ u16 unk_02;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
} Struct_D_8010B510_jp; // size = 0xC

Struct_D_8010B510_jp D_8010B510_jp[] = {
    { 0xD008, 0x0000, 0x00000205, 0x00000002 }, { 0xD01E, 0x0000, 0x00000205, 0x00000002 },
    { 0xD03A, 0x0000, 0x00000205, 0x00000002 }, { 0xD03B, 0x0000, 0x00000205, 0x00000002 },
    { 0xD03C, 0x0000, 0x00000205, 0x00000002 }, { 0xD009, 0x0000, 0x00000205, 0x00000002 },
    { 0xD00A, 0x0000, 0x00000205, 0x00000002 }, { 0xD00B, 0x0000, 0x00000205, 0x00000002 },
    { 0xD014, 0x0000, 0x00000205, 0x00000002 }, { 0xD019, 0x0000, 0x00000205, 0x00000002 },
    { 0xD015, 0x0000, 0x00000205, 0x00000002 }, { 0xD01A, 0x0000, 0x00000205, 0x00000002 },
    { 0xD016, 0x0000, 0x00000205, 0x00000002 }, { 0xD01B, 0x0000, 0x00000205, 0x00000002 },
    { 0xD017, 0x0000, 0x00000205, 0x00000002 }, { 0xD01C, 0x0000, 0x00000205, 0x00000002 },
    { 0xD001, 0x0000, 0x00000206, 0x00000002 }, { 0xD013, 0x0000, 0x00000206, 0x00000002 },
    { 0xD02C, 0x0000, 0x00000206, 0x00000002 }, { 0xD039, 0x0000, 0x00000206, 0x00000002 },
    { 0xD00C, 0x0001, 0x00000207, 0x00000002 }, { 0xD03D, 0x0001, 0x00000207, 0x00000002 },
    { 0xD006, 0x0000, 0x00000208, 0x00000002 }, { 0xD000, 0x0000, 0x00000209, 0x00000003 },
    { 0xD00F, 0x0000, 0x0000020A, 0x00000002 }, { 0xD002, 0x0000, 0x0000020B, 0x00000002 },
    { 0xD007, 0x0001, 0x0000020C, 0x00000008 }, { 0xD003, 0x0001, 0x0000020D, 0x00000004 },
    { 0xD012, 0x0001, 0x0000020E, 0x00000004 }, { 0xD011, 0x0000, 0x0000020F, 0x00000003 },
    { 0xD00D, 0x0000, 0x00000210, 0x00000002 }, { 0xD010, 0x0000, 0x00000210, 0x00000003 },
    { 0xD04E, 0x0000, 0x00000210, 0x00000002 }, { 0xD00E, 0x0000, 0x00000211, 0x00000002 },
    { 0xD025, 0x0000, 0x00000212, 0x00000003 }, { 0xA004, 0x0002, 0x00000213, 0x00000002 },
    { 0xA005, 0x0002, 0x00000213, 0x00000002 }, { 0xA006, 0x0002, 0x00000213, 0x00000002 },
    { 0xA007, 0x0002, 0x00000213, 0x00000002 }, { 0xD018, 0x0002, 0x00000214, 0x00000002 },
    { 0xD05D, 0x0002, 0x00000214, 0x00000002 }, { 0xD066, 0x0002, 0x00000214, 0x00000002 },
    { 0xD004, 0x0000, 0x00000215, 0x00000002 }, { 0xD005, 0x0000, 0x00000215, 0x00000002 },
    { 0xD01D, 0x0000, 0x00000216, 0x00000002 }, { 0xD026, 0x0000, 0x00000217, 0x00000002 },
    { 0xD037, 0x0000, 0x00000218, 0x00000002 }, { 0xD03E, 0x0000, 0x000004E0, 0x00000002 },
    { 0xD065, 0x0000, 0x000004E0, 0x00000002 }, { 0xD068, 0x0000, 0x000004E0, 0x00000002 },
    { 0xD069, 0x0000, 0x000004E0, 0x00000002 }, { 0xD06B, 0x0000, 0x000004E0, 0x00000002 },
    { 0xD064, 0x0000, 0x000004E1, 0x00000002 }, { 0x800D, 0x0000, 0x000004E2, 0x00000002 },
    { 0x800E, 0x0000, 0x000004E2, 0x00000002 }, { 0xA008, 0x0000, 0x000004E2, 0x00000002 },
    { 0xA009, 0x0000, 0x000004E2, 0x00000002 }, { 0xA00A, 0x0000, 0x000004E2, 0x00000002 },
    { 0xA00B, 0x0000, 0x000004E2, 0x00000002 }, { 0xA00C, 0x0000, 0x000004E2, 0x00000002 },
    { 0xA00D, 0x0000, 0x000004E2, 0x00000002 }, { 0xA00E, 0x0000, 0x000004E2, 0x00000002 },
    { 0xA00F, 0x0000, 0x000004E2, 0x00000002 }, { 0xA010, 0x0000, 0x000004E2, 0x00000002 },
};

u8 D_8010B810_jp[PLAYER_NAME_LEN] = { 0xD4, 0x8E, 0xA6, 0x90, 0x85, 0x42 };

u8 D_8010B818_jp[] = { 0xD3, 0xAF, 0x9D, 0x20 };

s32 D_8010B81C_jp[] = { 0, 2 };

s32 D_8010B824_jp[] = { 0x314, 0x334, 0x2F4, 0x219, 0x1E5, 0x354, 0x374, 0x394, 0x3D4, 0x3F4, 0x3B4 };

s32 D_8010B850_jp[] = {
    0x00000020, 0x00000040, 0x00000000, 0x00000060, 0x00000080, 0x000000A0,
};
s32 D_8010B868_jp[] = {
    0x000000E0, 0x00000100, 0x000000C0, 0x00000120, 0x00000140, 0x00000160,
};

s32* D_8010B880_jp[] = { D_8010B850_jp, D_8010B868_jp };

s32 D_8010B888_jp[] = { 0xC5, 0xD8 };

typedef void (*Funcs_D_8010B890_jp)(Mail_c*, Private_c*, AnmPersonalID_c*, Anmremail_c*, u8);
Funcs_D_8010B890_jp D_8010B890_jp[] = {
    func_800A8F30_jp,
    func_800A8DB4_jp,
};

s32 D_8010B898_jp[] = { 5, 2, 0 };
s32 D_8010B8A4_jp[] = { 0, 0, 2 };

s32 D_8010B8B0_jp[] = { 1, 0 };

u8 D_8010B8B8_jp[] = {
    0x00, 0x00, 0x02, 0x02, 0xFF,
};

typedef struct Struct_D_8010B8C0_jp {
    /* 0x00 */ s32 unk_00;
    /* 0x00 */ s32 unk_04;
} Struct_D_8010B8C0_jp; // size = 0x8

Struct_D_8010B8C0_jp D_8010B8C0_jp[] = {
    { 0x00000000, 0x00000000 }, { 0xFFFFFFFF, 0x00000001 }, { 0x00000000, 0x00000001 },
    { 0x00000001, 0x00000001 }, { 0xFFFFFFFF, 0x00000000 }, { 0x00000001, 0x00000000 },
    { 0xFFFFFFFF, 0xFFFFFFFF }, { 0x00000000, 0xFFFFFFFF }, { 0x00000001, 0xFFFFFFFF },
};

u16 D_8010B908_jp[] = { 0, 0xA012, 0xFFFF, 0xFFFF, 0xFFFF, 0xFFFF, 0xFFFF, 0xFFFF, 0xFFFF };

s32 D_8010B91C_jp[] = { 4, 4, 2, 2, 3, 4 };

s32 D_8010B934_jp[] = { 0x28, 0x32, 0x3C, 0x46, 0x50, 0x5A, 0x64 };

typedef struct Struct_D_8010B950_jp {
    /* 0x00 */ u16 unk_00;
    /* 0x02 */ u8 unk_02;
    /* 0x03 */ u8 unk_03;
} Struct_D_8010B950_jp; // size = 0x4

Struct_D_8010B950_jp D_8010B950_jp[] = {
    { 0x0FA0, 0x0C, 0x0F }, { 0x0BB8, 0x0A, 0x0D }, { 0x0FA0, 0x0C, 0x0F },
    { 0x0FA0, 0x0A, 0x0D }, { 0x1388, 0x09, 0x0C }, { 0x1388, 0x09, 0x0C },
};

s32 D_8010B968_jp = -1;

s32 B_80142C00_jp[60];
u8 B_80142CF0_jp[HANDBILL_HEADER_LEN];

typedef struct Struct_B_80142D08_jp {
    /* 0x00 */ char unk00[0x1];
    /* 0x01 */ u8 unk_01;
    /* 0x02 */ u8 unk_02;
    /* 0x03 */ u8 unk_03;
    /* 0x04 */ u8 unk_04;
} Struct_B_80142D08_jp; // size = 0x5

Struct_B_80142D08_jp B_80142D08_jp[60];
u8 B_80142E38_jp[HANDBILL_FOOTER_LEN];
u8 B_80142E58_jp[0x1B];
UNK_TYPE1 PAD_80142E73_jp[3];
Struct_D_E03000 B_80142E78_jp;
u8 B_80142E80_jp[HANDBILL_HEADER_LEN];
u8 B_80142E98_jp[HANDBILL_FOOTER_LEN];
u16 B_80142EB8_jp[16];

typedef struct Struct_B_80142ED8_jp {
    /* 0x00 */ u16 unk_00;
    /* 0x02 */ u8 unk_02;
    /* 0x03 */ u8 unk_03;
    /* 0x04 */ u16 unk_04;
    /* 0x06 */ u16 unk_06;
} Struct_B_80142ED8_jp; // size = 0x8

Struct_B_80142ED8_jp B_80142ED8_jp[ANIMAL_NUM_MAX];

u8 B_80142F50_jp[PLAYER_NAME_LEN];
u8 B_80142F58_jp[PLAYER_NAME_LEN];
u8 B_80142F60_jp[PLAYER_NAME_LEN];
u8 B_80142F68_jp[PLAYER_NAME_LEN];

typedef struct Struct_B_80142F70_jp {
    /* 0x00 */ AnmPersonalID_c id;
    /* 0x0C */ u8 unk_0C;
} Struct_B_80142F70_jp; // size = 0x10

Struct_B_80142F70_jp B_80142F70_jp;
Mail_c B_80142F80_jp;
s32 B_80143028_jp[216];
Animal_c B_80143388_jp;

void func_800A6810_jp(s32* arg0, s32 arg1, s32 arg2) {
    s32 i;
    s32 j;

    for (i = 0; i < arg1; i++) {
        arg0[i] = i;
    }

    while (arg2--) {
        s32 temp;

        i = RANDOM(arg1);
        j = RANDOM(arg1);
        temp = arg0[i];
        arg0[i] = arg0[j];
        arg0[j] = temp;
    }
}

void func_800A6920_jp(u8* catchphrase, s32 len) {
    mem_clear(catchphrase, len, CHAR_SPACE);
}

void func_800A6940_jp(u8* npc_max) {
    if (*npc_max < ANIMAL_NUM_MAX) {
        (*npc_max)++;
    }
}

void func_800A695C_jp(u8* arg0) {
    if (*arg0 >= 6) {
        (*arg0)--;
    }
}

void mNpc_ClearAnimalPersonalID(AnmPersonalID_c* anm_id) {
    anm_id->npc_id = 0;
    anm_id->name_id = 0xFF;
    anm_id->land_id = 0xFFFF;
    anm_id->looks = 6;
    mNPS_reset_schedule_area(anm_id);
